package org.lanqiao.algo.elementary._08dp;

/**
 * @author Awacky
 * @date 2020/4/5 12:47
 */
//问题主题：区间调度问题
//        问题描述：
//        有n项工作，每项工作分别在si开始，ti结束。对每项工作，你都可以选择参加或不参加，但选择了参加某项工作就必须至始至终参加全程参与，即参与工作的时间段不能有重叠(即使开始的时间和结束的时间重叠都不行)。
//    此外工作的时间不能重复（即使开始的时间与结束的时间重叠是不被允许的）
//    你的目标是参与尽可能多的工作，那么最多能参加多少项工作呢？
//        限制条件：
//        1<=n<=100000
//        1<=si<=ti<=10^9
//        样例：
//        输入
//        n=5
//        s={1,2,4,6,8}
//        T={3,5,7,9,10}
//        输出
//        3(选择工作1, 3, 5)

public class Case03_区间调度问题 {

}
